app/controllers/attached_photos_controller.rb

  def new
    @attached_photo = AttachedPhoto.new
    @project = Project.find(params[:project_id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)

  def create
    @attached_photo = AttachedPhoto.new(params[:attached_photo])
    @attached_photo.project_id = params[:project_id];

      if @attached_photo.save
        flash[:notice] = 'AttachedPhoto was successfully created.'
      else
        flash[:error] = 'Error attaching photo'
      end
      redirect_to project_path(Project.find(@attached_photo.project_id))
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 3)

  def destroy
    @attached_photo = AttachedPhoto.find(params[:id])
    @attached_photo.destroy
    @project = Project.find(params[:project_id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 3)