app/controllers/attached_photos_controller.rb

SELECT * FROM `attached_photos`
---
  def index
    @attached_photos = AttachedPhoto.all

SELECT * FROM `attached_photos` WHERE (`attached_photos`.`id` = 1)
---
  def show
    @attached_photo = AttachedPhoto.find(params[:id])

SELECT * FROM `attached_photos` WHERE (`attached_photos`.`id` = 1)
---
  def edit
    @attached_photo = AttachedPhoto.find(params[:id])

INSERT INTO `attached_photos` (`photo_file_name`, `photo_file_size`, `updated_at`, `photo_content_type`, `created_at`) VALUES('avatarz-1161712778_i_9037_full.jpg', 44032, '2009-04-10 22:25:32', 'image/jpeg', '2009-04-10 22:25:32')
---
  def create
    @attached_photo = AttachedPhoto.new(params[:attached_photo])

    respond_to do |format|
      if @attached_photo.save

SELECT * FROM `attached_photos` WHERE (`attached_photos`.`id` = 2)
UPDATE `attached_photos` SET `photo_content_type` = 'image/gif', `updated_at` = '2009-04-17 21:23:59', `photo_file_size` = 5526, `photo_file_name` = 'questions.gif' WHERE `id` = 26
---
  def update
    @attached_photo = AttachedPhoto.find(params[:id])

    respond_to do |format|
      if @attached_photo.update_attributes(params[:attached_photo])

SELECT * FROM `attached_photos` WHERE (`attached_photos`.`id` = 11)
DELETE FROM `attached_photos` WHERE `id` = 11
---
  def destroy
    @attached_photo = AttachedPhoto.find(params[:id])
    @attached_photo.destroy