app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects`

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def edit #+либо свой, либо админ
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create #+либо админ, либо только свои
    @project = Project.new(params[:project])
    if (!current_user.is_admin)
     @project.author_id = @current_user.id
    end

   if @project.save
---
INSERT INTO `projects` (`updated_at`, `title`, `thumb_content_type`, `date`, `description`, `author_id`, `thumb_file_name`, `thumb_file_size`, `created_at`) VALUES('2009-05-07 14:56:54', 'Дворец', 'image/gif', '2009-05-07', 'Огромный', 1, '3.GIF', 2727, '2009-05-07 14:56:54')

  def update #+либо свой, либо админ
    @project = Project.find(params[:id])

    if (!current_user.is_admin && @project.author_id != @current_user.id)
      flash[:error] = "У Вас нет прав на данное действие!"
      redirect_back_or_default project_path(@project)
    end

    if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `thumb_content_type` = 'image/jpeg', `thumb_file_size` = 25756, `thumb_file_name` = 'x_321aeafa.jpg', `updated_at` = '2009-05-07 11:13:37' WHERE `id` = 2

  def destroy #+либо свой, либо админ
    @project = Project.find(params[:id])

    if (!current_user.is_admin && @project.author_id != @current_user.id)
      flash[:error] = "У Вас нет прав на данное действие!"
      redirect_back_or_default project_path(@project)
    else
      @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1