app/controllers/user_sessions_controller.rb

SELECT * FROM `users` WHERE (LOWER(`users`.login) = 'llll') LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      flash[:notice] = "Добро пожаловать, " + User.find(@user_session.user).name + "!"