app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
   def show
     @user = User.find_by_id(params[:id])

SELECT * FROM `users`
---
  def new
    if (User.all.length==0 ||(current_user && @current_user.is_admin))

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def edit
    if (current_user && @current_user.is_admin)
      @user = User.find_by_id(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
INSERT INTO `users` (`name`, `updated_at`, `photo_file_name`, `photo_file_size`, `crypted_password`, `thumb_content_type`, `perishable_token`, `password_salt`, `is_admin`, `description`, `photo_content_type`, `persistence_token`, `birth_date`, `login`, `surname`, `thumb_file_name`, `thumb_file_size`, `created_at`) VALUES('nnnn', '2009-05-27 23:16:02', NULL, NULL, 'a66006c2a4269dad65a5646a929d38f29ca8ed21e31fda059b2a373ddc27fe9bf263b85213f3b24c560a6e74806dc10bb41150a0f9d7cbfccf9b9294f9f6fb49', NULL, 'Xzd6df5CUbetTD0B3ELD', 'PVL8DWZm6uImMA_VRV_h', 1, 'nnnn', NULL, '1923da0a9f2798277a9ba7a4415e1d35d5b69926e4ea5232d1493e7c99f398ede582b4a7d4edae156135becc7de50705a97288ec2965cfd093c4aa72ef0b4bc1', NULL, 'nnnn', 'nnnn', NULL, NULL, '2009-05-27 23:16:02')
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`login`) = BINARY 'l') LIMIT 1
---
  def create

    @user = User.new(params[:user])

    if User.find(:all).length==0
      @user.is_admin = true
    else if (!current_user || !@current_user.is_admin)
      flash[:error] = "У Вас нет прав на данное действие!"
      redirect_back_or_default root_path
      end
    end

    if @user.save
       flash[:notice] = 'Архитектор был добавлен'
       redirect_back_or_default user_path(User.find(:first, :conditions => "login = '"+@user.login+"'"))

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
SELECT * FROM `users` WHERE (is_admin = true)
UPDATE `users` SET `perishable_token` = 'OQRXyq4Y8yEBVmjgv9hU', `thumb_content_type` = 'image/jpeg', `birth_date` = '1980-05-27', `photo_content_type` = 'image/jpeg', `thumb_file_size` = 16384, `thumb_file_name` = 'котенок.jpg', `updated_at` = '2009-05-27 23:29:31', `photo_file_size` = 16384, `photo_file_name` = 'котенок.jpg' WHERE `id` = 4
---
  def update
    @user = User.find_by_id(params[:id])

    if (@user.is_admin && User.find(:all, :conditions => "is_admin = true").length==1)
      params[:user][:is_admin]=true;
    end

    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
DELETE FROM `users` WHERE `id` = 1
---
 def destroy
    @user = User.find(params[:id])

    if (!current_user || !@current_user.is_admin || @user.id == @current_user.id)
      flash[:error] = "У Вас нет прав на данное действие!"
      redirect_back_or_default user_path(@user)
    else
    if (@user.is_admin &&User.find(:all, :conditions => "is_admin = true").length==1)
      flash[:error] = "Нельзя удалить единственного администратора!"
      redirect_back_or_default user_path(@user)
    else
      Project.find(:all, :conditions=>"author_id="+@user.id).each do |project|
        project.update_attribute(:author_id, -1)
      end
      @user.destroy